[
    {
        "id": "1",
        "level": "medium",
        "titleID": "Kematian di Jendela",
        "questionID": "Seorang pria memutuskan untuk tidur di kamar hotel lantai 20. Malam itu, suara dentuman keras membangunkannya. Keesokan harinya, polisi menemukan pria itu tewas di jalan. Namun, jendela kamarnya terkunci dari dalam.",
        "solutionID": "Pria itu menderita sleepwalking (berjalan sambil tidur). Suara dentuman keras adalah suara petir yang membangunkannya saat dia berada di ambang jendela. Dalam kebingungan, dia terpeleset dan jatuh. Jendela yang terkunci dari dalam adalah bukti bahwa dia tidak melompat dengan sengaja.",
        "titleEN": "The Locked Window Death",
        "questionEN": "A man decided to sleep in his hotel room on the 20th floor. That night, a loud bang woke him up. The next morning, the police found the man dead on the street. However, his room window was locked from the inside.",
        "solutionEN": "The man was a sleepwalker. The loud bang was thunder that startled him awake while he was standing on the window ledge. Confused, he slipped and fell. The locked window from the inside proves it wasn’t a deliberate jump.",
        "color": "1"
    },
    {
        "id": "2",
        "level": "medium",
        "titleID": "Misteri di Lift",
        "questionID": "Seorang pria ditemukan tewas di dalam lift sebuah gedung pencakar langit. Tidak ada saksi mata, namun tombol darurat lift ditekan.",
        "solutionID": "Pria itu adalah teknisi lift yang terjebak mekanisme lift. Tombol darurat tertekan saat dia mencoba menyelamatkan diri.",
        "titleEN": "The Elevator Mystery",
        "questionEN": "A man was found dead in an elevator. The emergency button was pressed, but no one was there.",
        "solutionEN": "The man was an elevator technician trapped in the mechanism. The emergency button was pressed as he tried to save himself.",
        "color": "2"
    },
    {
        "id": "3",
        "level": "easy",
        "titleID": "Tamu Tak Terlihat",
        "questionID": "Seorang wanita mendengar ketukan tengah malam. Ketika membuka pintu, tak ada siapa pun. Pagi hari, ditemukan jejak kaki basah di pintu belakang.",
        "solutionID": "Pencuri mengetuk pintu depan untuk mengalihkan perhatian sebelum kabur ke arah pintu belakang.",
        "titleEN": "The Invisible Guest",
        "questionEN": "A woman heard a knock at midnight but found no one outside. Wet footprints were found leading to the back door the next morning.",
        "solutionEN": "The thief knocked on the front door to distract her before escaping toward the back door.",
        "color": "3"
    },
    {
        "id": "4",
        "level": "medium",
        "titleID": "Darah di Tangan",
        "questionID": "Seorang pria berlari ke polisi dengan tangan berlumuran darah, mengatakan dia menemukan mayat di hutan.",
        "solutionID": "Pria itu menemukan lokasi kecelakaan pesawat kecil. Darah berasal dari usahanya memeriksa korban kecelakaan.",
        "titleEN": "Blood on His Hands",
        "questionEN": "A man ran to the police with bloodied hands, claiming he found a body in the forest.",
        "solutionEN": "The man stumbled upon a plane crash site. The blood was from checking the victim for signs of life.",
        "color": "4"
    },
    {
        "id": "5",
        "level": "easy",
        "titleID": "Lilin Terakhir",
        "questionID": "Di pesta ulang tahun, lilin terakhir di kue terus menyala meskipun ditiup banyak orang.",
        "solutionID": "Lilin itu adalah lilin ajaib yang menyala kembali setelah ditiup.",
        "titleEN": "The Last Candle",
        "questionEN": "At a birthday party, the last candle kept relighting despite being blown out by many people.",
        "solutionEN": "The candle was a trick candle designed to relight after being blown out.",
        "color": "1"
    },
    {
        "id": "6",
        "level": "easy",
        "titleID": "Bayangan di Foto",
        "questionID": "Fotografer melihat bayangan aneh di latar belakang semua foto yang diambil di gedung tua.",
        "solutionID": "Bayangan itu adalah refleksi dirinya sendiri pada kaca besar yang memantulkan cahaya.",
        "titleEN": "The Shadow in the Photos",
        "questionEN": "A photographer noticed a strange shadow in all pictures taken at an old building.",
        "solutionEN": "The shadow was his own reflection on large glass windows catching light at specific angles.",
        "color": "2"
    },
    {
        "id": "7",
        "level": "hard",
        "titleID": "Hilang di Padang Salju",
        "questionID": "Seorang pendaki ditemukan tewas di padang salju tanpa jejak kaki di sekitarnya.",
        "solutionID": "Pendaki itu tertimbun longsoran salju yang menutupi jejak kakinya sebelum mati kedinginan.",
        "titleEN": "Lost in the Snowfield",
        "questionEN": "A hiker was found dead in a snowfield with no footprints around him.",
        "solutionEN": "The hiker was caught in an avalanche that buried his footprints and froze to death.",
        "color": "3"
    },
    {
        "id": "8",
        "level": "medium",
        "titleID": "Minuman Mematikan",
        "questionID": "Dua orang minum koktail yang sama. Satu orang meninggal, sementara yang lain baik-baik saja.",
        "solutionID": "Racun ada di es yang mencair. Yang meninggal meminum setelah es mencair, sementara yang selamat meminum lebih cepat.",
        "titleEN": "The Deadly Drink",
        "questionEN": "Two people drank the same cocktail. One died, while the other was fine.",
        "solutionEN": "The poison was in the ice cubes. The deceased drank after the ice melted, while the survivor drank quickly.",
        "color": "4"
    },
    {
        "id": "9",
        "level": "hard",
        "titleID": "Tulang di Perapian",
        "questionID": "Arkeolog menemukan tulang manusia di perapian rumah kosong puluhan tahun.",
        "solutionID": "Tulang itu sisa jenazah yang dibakar pemilik sebelumnya untuk menyembunyikan bukti.",
        "titleEN": "Bones in the Fireplace",
        "questionEN": "An archaeologist found human bones in the fireplace of a house abandoned for decades.",
        "solutionEN": "The bones were remains of someone burned by the previous owner to hide evidence.",
        "color": "1"
    },
    {
        "id": "10",
        "level": "hard",
        "titleID": "Lukisan yang Mengintip",
        "questionID": "Tamu merasa diawasi oleh mata pada lukisan di kamar tamu sebuah rumah besar.",
        "solutionID": "Lukisan itu memiliki lubang kecil pada mata yang digunakan untuk mengintip tamu.",
        "titleEN": "The Watching Painting",
        "questionEN": "A guest felt watched by the eyes of a painting in the guest room of a large mansion.",
        "solutionEN": "The painting had small holes in the eyes used to spy on guests.",
        "color": "2"
    },
    {
        "id": "11",
        "level": "medium",
        "titleID": "Jam yang Hilang",
        "questionID": "Seorang pria mendengar detak jam, tetapi tidak ada jam di ruangan itu.",
        "solutionID": "Detak itu berasal dari jam tersembunyi di dinding, digunakan penghuni lama untuk menyimpan barang berharga.",
        "titleEN": "The Missing Clock",
        "questionEN": "A man heard a clock ticking, but there was no clock in the room.",
        "solutionEN": "The ticking came from a clock hidden inside the wall, used by the previous owner as a secret stash.",
        "color": "3"
    },
    {
        "id": "12",
        "level": "easy",
        "titleID": "Pesan di Cermin",
        "questionID": "Setiap pagi, seorang wanita melihat tulisan di cermin kamar mandi yang tidak pernah dia tulis.",
        "solutionID": "Tulisan itu berasal dari uap yang menempel di cermin, mengungkapkan pesan yang ditulis penghuni sebelumnya menggunakan minyak.",
        "titleEN": "Message on the Mirror",
        "questionEN": "Every morning, a woman sees writing on her bathroom mirror that she never wrote.",
        "solutionEN": "The writing was revealed by steam and was written by a previous resident using oil.",
        "color": "4"
    },
    {
        "id": "13",
        "level": "medium",
        "titleID": "Jam yang Berhenti",
        "questionID": "Semua jam di sebuah rumah besar berhenti di pukul 3:15.",
        "solutionID": "Jam-jam itu berhenti karena korsleting listrik yang terjadi saat badai menghantam rumah tepat pada pukul tersebut.",
        "titleEN": "The Stopped Clocks",
        "questionEN": "All clocks in a large house stopped at 3:15.",
        "solutionEN": "The clocks stopped due to an electrical short circuit caused by a storm hitting the house at that exact time.",
        "color": "1"
    },
    {
        "id": "14",
        "level": "hard",
        "titleID": "Pintu yang Terkunci",
        "questionID": "Seorang pria ditemukan tewas di dalam kamar terkunci. Tidak ada jendela terbuka atau pintu lain.",
        "solutionID": "Pria itu meninggal akibat gas beracun yang bocor di kamar tersebut. Tidak ada tanda kerusakan karena gas tidak meninggalkan jejak fisik.",
        "titleEN": "The Locked Door",
        "questionEN": "A man was found dead in a locked room. No windows were open, and there was no other door.",
        "solutionEN": "The man died from toxic gas leaking into the room. There were no signs of disturbance because gas leaves no physical trace.",
        "color": "2"
    },
    {
        "id": "15",
        "level": "easy",
        "titleID": "Bayangan di Tembok",
        "questionID": "Bayangan seseorang terlihat di dinding, namun tidak ada orang di sana.",
        "solutionID": "Bayangan itu berasal dari patung yang berbentuk seperti manusia yang diterangi cahaya.",
        "titleEN": "Shadow on the Wall",
        "questionEN": "A shadow of a person was seen on the wall, but no one was there.",
        "solutionEN": "The shadow came from a statue shaped like a person illuminated by light.",
        "color": "3"
    },
    {
        "id": "16",
        "level": "medium",
        "titleID": "Suara dari Bawah Tanah",
        "questionID": "Setiap malam terdengar suara langkah kaki dari bawah tanah sebuah rumah kosong.",
        "solutionID": "Suara itu berasal dari tikus yang berlarian di pipa bawah tanah rumah tersebut.",
        "titleEN": "The Sound from Underground",
        "questionEN": "Every night, footsteps were heard from the underground of an empty house.",
        "solutionEN": "The sound came from rats running through the house’s underground pipes.",
        "color": "4"
    },
    {
        "id": "17",
        "level": "easy",
        "titleID": "Minuman yang Berasap",
        "questionID": "Minuman di sebuah kafe tampak mengeluarkan asap, membuat pengunjung ketakutan.",
        "solutionID": "Asap itu berasal dari es kering yang bereaksi dengan udara, menciptakan efek dramatis.",
        "titleEN": "The Smoking Drink",
        "questionEN": "A drink at a café seemed to be emitting smoke, scaring the customers.",
        "solutionEN": "The smoke was from dry ice reacting with the air, creating a dramatic effect.",
        "color": "1"
    },
    {
        "id": "18",
        "level": "hard",
        "titleID": "Warisan yang Hilang",
        "questionID": "Seorang pewaris kaya kehilangan semua uangnya setelah menerima surat wasiat.",
        "solutionID": "Pewaris tersebut tidak menyadari bahwa ia juga mewarisi hutang besar dari kerabatnya, yang menyebabkan kebangkrutan.",
        "titleEN": "The Lost Inheritance",
        "questionEN": "A wealthy heir lost all his money after receiving a will.",
        "solutionEN": "The heir did not realize that he also inherited massive debts from his relative, leading to bankruptcy.",
        "color": "2"
    },
    {
        "id": "19",
        "level": "easy",
        "titleID": "Aroma di Malam Hari",
        "questionID": "Setiap malam, aroma wangi semerbak tercium di lorong sebuah apartemen.",
        "solutionID": "Aroma itu berasal dari bunga melati yang ditanam tetangga dekat lorong tersebut.",
        "titleEN": "The Nighttime Fragrance",
        "questionEN": "Every night, a strong fragrance was smelled in the hallway of an apartment.",
        "solutionEN": "The fragrance came from jasmine flowers planted by a neighbor near the hallway.",
        "color": "3"
    },
    {
        "id": "20",
        "level": "hard",
        "titleID": "Cahaya di Puncak Bukit",
        "questionID": "Pendaki melihat cahaya berkedip-kedip di puncak bukit pada malam hari.",
        "solutionID": "Cahaya itu berasal dari drone yang digunakan untuk merekam pemandangan malam.",
        "titleEN": "The Light on the Hilltop",
        "questionEN": "A hiker saw flashing lights on a hilltop at night.",
        "solutionEN": "The lights came from a drone being used to record nighttime scenery.",
        "color": "4"
    },
    {
        "id": "21",
        "level": "hard",
        "titleID": "Perahu di Tengah Padang",
        "questionID": "Sebuah perahu ditemukan di tengah padang rumput tanpa sungai atau laut di dekatnya.",
        "solutionID": "Perahu itu dibawa ke lokasi oleh tornado besar yang menyeretnya jauh dari sumber air.",
        "titleEN": "A Boat in the Field",
        "questionEN": "A boat was found in the middle of a field with no rivers or seas nearby.",
        "solutionEN": "The boat was carried to the location by a massive tornado, dragging it far from any water source.",
        "color": "1"
    },
    {
        "id": "22",
        "level": "hard",
        "titleID": "Pintu yang Salah",
        "questionID": "Seorang penjaga harus memilih pintu yang akan dibuka, tetapi salah satu pintu akan menutupinya dengan kegelapan abadi.",
        "solutionID": "Semua pintu memiliki penghalang, tetapi satu pintu tidak terlihat oleh siapa pun yang melaluinya—karena hanya bisa terlihat oleh mereka yang jujur.",
        "titleEN": "The Wrong Door",
        "questionEN": "A guard faces a decision of choosing a door.",
        "solutionEN": "All doors have obstacles, but one is invisible to those who are not honest.",
        "color": "2"
    },
    {
        "id": "23",
        "level": "medium",
        "titleID": "Peta yang Menipu",
        "questionID": "Seorang petualang menggunakan peta tua untuk menemukan harta karun, tetapi setiap petunjuk yang diberikan membuat mereka kembali ke tempat awal.",
        "solutionID": "Peta tersebut tidak memandu mereka ke harta karun, tetapi mengarahkan mereka ke kenyataan bahwa harta sebenarnya ada dalam perjalanan, bukan di akhir.",
        "titleEN": "The Deceptive Map",
        "questionEN": "An adventurer follows a map to find treasure.",
        "solutionEN": "The map only led them back to the start, revealing the real treasure is the journey itself.",
        "color": "3"
    }
]